       IDENTIFICATION DIVISION.
       PROGRAM-ID. Hello_World.
      *********************************************
      ***    AREA DE COMENTARIOS
      ***    OBJETIVO DO PROGRAMA: MOSTRAR O HELLO WORLD
      ***    AUTHOR: LUCAS OLIVEIRA(LooKs)
      ***    DATA: 23/10/2019
      *********************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
          DISPLAY 'HELLO WORLD'.
          STOP RUN.
